app/Controllers/Admin/PayrollController.php

    public function index()
    {
        $fetch =  $this->db->table("users");
        $fetch_user = $fetch->select('id,employee_code')->where('id !=',1)->get()->getResultArray();
---
SELECT `id`, `employee_code`
FROM `users`
WHERE `id` != 1

    public function payrollLayout()
    {
        $data = $this->request->getVar();
        $employee_id = $data['emp_id'];

        $month = ['Jan','Feb','Mar','Apr','May','June','July','Aug','Sept','Oct','Nov','Dec'];

        $get_user = $this->db->table("payroll_slip");

        $get_payroll = $get_user->where('user_id',$employee_id)->get()->getResultArray();
---
SELECT *
FROM `payroll_slip`
WHERE `user_id` = '2'

    public function uploadExcelPayslip()
    {
        $file = $this->request->getFile('file');
        $newdata = $this->request->getVar();
        $user_id = $newdata['emp_id'];

        $newName = $file->getRandomName();
        $file->move(WRITEPATH.'../public/excelfile', $newName);

        $path = base_url().'/public/excelfile/'.$newName;

        $get_link = $this->db->table("excel_payslip");
        $fetch_sample = $get_link->where('user_id',$user_id)->get()->getFirstRow();
---
SELECT *
FROM `excel_payslip`
WHERE `user_id` = '2'

    public function downloadExcelSample()
    {
        $newdata = $this->request->getVar();
        $user_id = $newdata['emp_id'];

        $get_link = $this->db->table("excel_payslip");
       $fetch_sample = $get_link->where('user_id',$user_id)->get()->getFirstRow();
---
SELECT *
FROM `excel_payslip`
WHERE `user_id` = '2'